[
    "Funksional ketma-ketliklar va ularning limiti. (Funksional ketma-ketlik tushunchasi, funksional ketma-ketlikning limitik funksiyasi ta’rifi va unga oid misollar)",
    "Funksional ketma-ketliklarda hadma-had limitga o’tish va unga oid misollar",
    "Funksional qatorlar va ularning yaqinlashishi (Funksional qator  ta’rifi, uning yaqinlashish sohasiga oid misollar)",
    "Funksional qatorlarni hadma-had limitga o’tish (Funksional qatorni hadma-had limitga o’tishi haqidagi teorema va unga oid misollar)",
    "Darajali qatorlar (Abel teoremasi).",
    "Darajali qatorlarning xossalari.",
    "fazoning muhim elementlari (ochiq shar, yopiq shar, sfera, atrof tushunchasi)",
    "Ko’p o’zgaruvchili funksiyaning aniqlanish sohasini topish va unga oid misollar",
    "fazoda metrika tushunchasi va unga oid misollar",
    "Ketma-ketlik limit ta’rifiga oid misollar (Koshi ta’rifi)",
    "Ko’p o’zgaruvchili funksiya tushunchasi va unga oid misollar",
    "Ko’p o’zgaruvchili funksiya uzluksizlik ta’riflari (Koshi, Geyne ta’riflar)",
    "Ko’p o’zgaruvchili funksiya hosilasi va unga oid misollar",
    "Ko’p o’zgaruvchili funksiyaning differensiali va unga oid misollar",
    "Ko’p o’zgaruvchili funksiyaning yo’nalish bo’yicha hosilasi va unga oid misollar",
    "Ko’p ozgaruvchili funksiyaning ikkinchi tartibli hosilasi va unga oid misollar",
    "Ko’p o’zgaruvchiuli funksiyaning ikkinchi tartibli differensiali",
    "Ko’p o’zgaruvchili funksiya ekstremumi ta’riflari va unga oid misollar",
    "Ko’p o’zgaruvchili funksiyaning ekstremum ta’riflari",
    "Ko’p o’zgaruvchili funksiyani shartli ekstremumga tekshirish",
    "Parametrga bog’liq xosmas integral tushunchasi va unga oid misollar",
    "Ikki karrali integral tushunchasi va unga oid misollar",
    "Ikki karrali integralning mexanikaga tatbig’i",
    "Ikki karrali integral uchun Darbu yig’indilari",
    "Ikki karrali integrallarning tadbiqlari va ularga oid misollar",
    "Uch  karrali integral tushunchasi va unga oid misollar",
    "Birinchi tur egri chiziqli integral tushunchasi va unga oid misollar",
    "Sirt tushunchasi va unga oid misollar",
    "Sirtning parametrik ko’rinishidagi tenglamasi va unga oid misollar",
    "Birinchi tur sirt integrallari ta’rifi va unga oid misollar"
]