[
    "Funksional ketma-ketliklarning tekis yaqinlashishi haqidagi teoremalar. (Funksional ketma-ketlikning limitik funksiyaga tekis yaqinlashishi va oddiy yaqinlashishi, ularga oid misollar)",
    "Funksionla ketma-ketliklarni hadlab differensiallash.",
    "Funksional qatorlarning tekis yaqinlashuvchanligi (Funksional qatorning tekis va oddiy yaqinlashish ta’rifari va ularga oid misollar)",
    "Funksional qatorlarni hadma-had integrallash (Funksional qatorlarni hadma-had integrallash haqidagi teorema va unga oid misollar)",
    "Darajali qatorlarning yaqinlashish radiusi va yaqinlashish intervali.",
    "Darajali qatorlarni hadma-had differensiallash.",
    "fazoda sonli ketma-ketlik va uning limiti ta’riflari",
    "Ko’p o’zgaruvchili funksiyaning qiymatlar sohasini topish va unga oid misollar",
    "fazoda ketma-ketlik limiti ta’riflari va unga oid misollar",
    "Koshi-Bunyakovskiy tengsizligini isbotlang",
    "Ko’p o’zgaruvchili funksiya limiti ta’riflari (Geyne, Koshi ta’riflari)",
    "Ko’p o’zgaruvchili funksiya uzluksizlik xossalari",
    "Ko’p o’zgaruvchili funksiya hosilasining sodda qoidalari va ularga oid misollar",
    "Ko’p o’zgaruvchili funksiya differensialining sodda qoidalari",
    "Ko’p o’zgaruvchili funksiyaning gradient va unga oid misollar",
    "Ko’p o’zgaruvchili funksiyaning n- tartibli hosilasi va unga oid misollar",
    "Ko’p o’zgaruvchili funksiyaning differensiallanuvchanlik sharti",
    "Ko’p o’zgaruvchili funksiya ekstremumining zaruriy va yetarli shartlari",
    "Ko’p o’zgaruvchili funksiya ekstremumining yetarli sharti va unga oid misollar",
    "Lagranj funksiyasi yordamida ko’p o’zgaruvchili funksiyani ekstremumga tekshirish",
    "Parametrga bog’liq xosmas integralning tekis yaqinlashishi",
    "Ikki karrali integrallarda o’zgaruvchilarni almashtirish",
    "Ikki karrali integralni hisoblashda qutb koorduinatalar sistemasidan foydalanish",
    "Ikki karrali integralning xossalari",
    "Ikki karrali integral yordamida jismning hajmini topish",
    "Uch karrali integralning xossalari",
    "Ikkinchi tur egri chiziqli integral tushunchasi va unga oid misollar",
    "Sirtning oshkormas ko’rinishidagi tenglamasi va unga oid misollar",
    "Sirtning yuzi va uni ikki karrali integral yordamida hisoblash",
    "Birinchi tur sirt integralining fizikaga qo’llanilishi"
]